[
  {
    "id": "f448932a-500e-4103-9ad7-9980ebe7a6c8",
    "title": "MS Dhoni - AI History Reel",
    "celebrity": "MS Dhoni",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/f448932a-500e-4103-9ad7-9980ebe7a6c8.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/MS_Dhoni_%28Prabhav_%2723_-_RiGI_2023%29.jpg/600px-MS_Dhoni_%28Prabhav_%2723_-_RiGI_2023%29.jpg",
    "script": "MS Dhoni: Sports legend and inspiration. His journey from humble beginnings to cricket greatness is a testament to his determination, skill, and impact. A shining example to all athletes, his record-breaking scores, and remarkable achievements have left an indelible mark on the world of sports. MS Dhoni continues to inspire generations, proving that with passion, discipline, and hard work, any dream is attainable. \n\n#sportslegend #msdhoni #inspiration",
    "createdAt": "2025-06-22T12:29:40.247Z"
  },
  {
    "id": "8263594c-6aa3-44f4-8ff8-75a7b972b894",
    "title": "Lebron James - AI History Reel",
    "celebrity": "Lebron James",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/8263594c-6aa3-44f4-8ff8-75a7b972b894.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/LeBron_James%2C_25_November_2023_02_%28cropped_2%29.jpg/960px-LeBron_James%2C_25_November_2023_02_%28cropped_2%29.jpg",
    "script": "LeBron James has risen from humble beginnings to become one of the greatest basketball players of all time. \nFrom a teenage prodigy to a global icon, his journey has been beyond impressive. \nAt 37 years young, he continues to defy the odds and delivers world-class performances that are nothing short of legendary. \nHe has excelled on the court and is the ultimate champion. \nHis stats speak for themselves, as he continues to add to his impressive portfolio of achievements. \nHe's multi-talented, a dedicated business entrepreneur, and a champion of social justice. \nLeBron is a true role model and an inspiration to athletes everywhere. \nHis legacy will continue to inspire for generations to come. \nLeBron James, a man on a mission, continues to raise the bar and it's safe to say that we are witnessing history in the making.",
    "createdAt": "2025-06-22T05:30:09.280Z"
  },
  {
    "id": "878ea1bb-c5f1-420c-98eb-f0e782c4c382",
    "title": "Virat Kholi - AI History Reel",
    "celebrity": "Virat Kholi",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/878ea1bb-c5f1-420c-98eb-f0e782c4c382.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Virat_Kohli_during_the_India_vs_Aus_4th_Test_match_at_Narendra_Modi_Stadium_on_09_March_2023.jpg",
    "script": "The ultimate goal machine - @virat.kohli \nThe legendary cricketer has achieved unprecedented accolades, consistently raising the bar for excellence. His stellar career boasts of myriad records, feats and benchmarks, solidifying his status as a living legend. \n\nA cricketing icon, Kohli's towering presence stands as a testament to the indomitable Indian spirit, conquering the sport with sheer passion and skill. \n\nHis unforgettable journey is laced with milestones beyond bounds, etching his name in golden script in the annals of cricketing history. \n\nA true inspiration for generations to follow. #viratkohli #legend #sports #inspiration #unleashyourpotential",
    "createdAt": "2025-06-22T05:27:54.943Z"
  }
]