[
  {
    "id": "280bd6d1-88d9-491b-b0a6-b304ea2633d7",
    "title": "Shane Watson - AI History Reel",
    "celebrity": "Shane Watson",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/280bd6d1-88d9-491b-b0a6-b304ea2633d7.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/SHANE_WATSON_%2811705862116%29.jpg/960px-SHANE_WATSON_%2811705862116%29.jpg",
    "script": "From cricket to football, this superstar has done it all. \nLet's talk about the sports legend that is Shane Watson. \n\nWatson's career began in 2003 and lasted over a decade. In that time, he took home 19 caps for Australia in football and over 100 in cricket. That alone shows his resilience and versatility as an athlete. \n\nHe scored a whopping 3874 runs in his international cricket career, with 11 centuries and a highest score of 185. He also scored 10,000 runs in his first-class games, proving his excellence over time. \n\nBut the accolades don't stop there. Watson was an integral part of the Australian cricket team that won the 2003 World Cup and the 2007 World Cup. His skills were unmatched. \n\nHis football career was also impressive, representing Australia in the FIFA Beach Soccer World Cup and being named goalkeeper of the tournament in the 2003 edition. \n\nWatson's achievements go beyond statistics. His determination, versatility, and unwavering sportsmanship have inspired many. \n\nSo, here's to Shane Watson, a true embodiment of strength, skill, and determination.",
    "createdAt": "2025-06-21T16:11:55.850Z"
  },
  {
    "id": "58013417-89d7-482f-a12b-acc7db016ebf",
    "title": "cristiano ronaldo - AI History Reel",
    "celebrity": "cristiano ronaldo",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/58013417-89d7-482f-a12b-acc7db016ebf.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Cristiano_Ronaldo_playing_for_Al_Nassr_FC_against_Persepolis%2C_September_2023_%28cropped%29.jpg/600px-Cristiano_Ronaldo_playing_for_Al_Nassr_FC_against_Persepolis%2C_September_2023_%28cropped%29.jpg",
    "script": "Crustiano Ronaldo... One of the greatest athletes of all time. Born on February 5, 1985 in Portugal, Cristiano grew up with a passion for football and an unwavering work ethic. His career skyrocketed when he joined Real Madrid in 2009, where he won numerous accolades, including four Champions Leagues. In 2015, he took his talent to Manchester United, where he led the team to several wins. Now, as captain of Al-Nassr, he continues to showcase his skills. Tune in to catch his thrilling plays. \n\nCristiano, a legend on and off the field, his legacy will continue to inspire generations of athletes.",
    "createdAt": "2025-06-21T10:11:00.872Z"
  },
  {
    "id": "79d7e951-4f0e-418f-bc6c-e147088b8731",
    "title": "Virat Kholi - AI History Reel",
    "celebrity": "Virat Kholi",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/79d7e951-4f0e-418f-bc6c-e147088b8731.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/e/ef/Virat_Kohli_during_the_India_vs_Aus_4th_Test_match_at_Narendra_Modi_Stadium_on_09_March_2023.jpg",
    "script": "You think you're a big fan of Virat Kohli? Join us as we dive into the sporting history and achievements of this legendary athlete. From his debut at a young age to becoming one of the most respected cricketers in the world, Virat's journey is nothing short of remarkable. He has amassed hundreds of billions of fans worldwide and achieved countless milestones. He is a true inspiration for aspiring athletes worldwide. Let's celebrate Virat's legacy together! \n\n#viratkohli #cricket #sports #fan #india",
    "createdAt": "2025-06-21T09:57:03.816Z"
  },
  {
    "id": "5b36b03d-1619-435b-9fc1-0cd58accb3f7",
    "title": "MS Dhoni - AI History Reel",
    "celebrity": "MS Dhoni",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/5b36b03d-1619-435b-9fc1-0cd58accb3f7.mp4",
    "thumbnailUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/MS_Dhoni_%28Prabhav_%2723_-_RiGI_2023%29.jpg/600px-MS_Dhoni_%28Prabhav_%2723_-_RiGI_2023%29.jpg",
    "script": "MS Dhoni - a cricketing legend, the epitome of determination and success. His journey from humble beginnings to sports glory is truly inspiring. \n\nFrom his initial days as a ticket collector to becoming a trusted captain, MS Dhoni's rise to the top is a testament to his unwavering spirit and unwavering commitment. His tactical acumen, unmatched catching skills, and calm demeanor made him a mainstay in the Indian cricket team. \n\nMS Dhoni's achievements on the field are nothing short of phenomenal! He led India to numerous victories, including the most celebrated 2011 World Cup win. He is known for his tactical brilliance and ability to turn the game at will. \n\nHis skills are revered by many, and his retirement from cricket left fans longing for his presence. MS Dhoni will forever be remembered as a revolutionary captain and an exceptional sportsperson who instilled pride in a billion souls. \n\nHis journey is a reminder to never give up on our dreams, no matter the challenges. Thanks, MS Dhoni, for inspiring generations with your sports prowess and unwavering dedication!",
    "createdAt": "2025-06-21T09:21:09.886Z"
  },
  {
    "id": "320bd312-86ac-4129-8f1c-ec1b94f538f6",
    "title": "Lionel essi - AI History Reel",
    "celebrity": "Lionel essi",
    "videoUrl": "https://dyqncpzaqbgsomgshxuj.supabase.co/storage/v1/object/public/aireels/320bd312-86ac-4129-8f1c-ec1b94f538f6.mp4",
    "thumbnailUrl": "https://images.unsplash.com/photo-1705702771001-3a4a068067a8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w3NjYxNzV8MHwxfHNlYXJjaHwxfHxMaW9uZWwlMjBlc3NpJTIwc3BvcnRzfGVufDB8MXx8fDE3NTA0OTY2NDJ8MA&ixlib=rb-4.1.0&q=80&w=1080",
    "script": "An iconic sports star, Lionel Messi has left an everlasting impact on the world of football. From his humble beginnings in Argentina to countless achievements and records, he has amazed and inspired millions. With a remarkable 1,000 professional goals, he is firmly entrenched in the realms of greatness. Whether dazzling fans with his skill or lifting trophies, he is a testament to the power of determination and the ability to achieve the impossible. Join me as we celebrate the legendary status of Lionel Messi, a footballer whose legacy will endure for generations.",
    "createdAt": "2025-06-21T09:04:22.589Z"
  }
]